{
  "label_mapping": {
    "0": "DoS",
    "1": "Normal",
    "2": "Probe",
    "3": "R2L",
    "4": "U2R"
  },
  "class_weights": {
    "Normal": 0.3745,
    "DoS": 0.5482,
    "Probe": 2.1512,
    "R2L": 25.4229,
    "U2R": 554.5375
  },
  "weight_map": {
    "1": 0.3745,
    "0": 0.5482,
    "2": 2.1512,
    "3": 25.4229,
    "4": 554.5375
  },
  "feature_cols": [
    "duration",
    "src_bytes",
    "dst_bytes",
    "land",
    "wrong_fragment",
    "urgent",
    "hot",
    "num_failed_logins",
    "logged_in",
    "num_compromised",
    "root_shell",
    "su_attempted",
    "num_root",
    "num_file_creations",
    "num_shells",
    "num_access_files",
    "num_outbound_cmds",
    "is_host_login",
    "is_guest_login",
    "count",
    "srv_count",
    "serror_rate",
    "srv_serror_rate",
    "rerror_rate",
    "srv_rerror_rate",
    "same_srv_rate",
    "diff_srv_rate",
    "srv_diff_host_rate",
    "dst_host_count",
    "dst_host_srv_count",
    "dst_host_same_srv_rate",
    "dst_host_diff_srv_rate",
    "dst_host_same_src_port_rate",
    "dst_host_srv_diff_host_rate",
    "dst_host_serror_rate",
    "dst_host_srv_serror_rate",
    "dst_host_rerror_rate",
    "dst_host_srv_rerror_rate",
    "protocol_type_ohe",
    "service_ohe",
    "flag_ohe"
  ],
  "n_train": 88726,
  "n_val": 18780,
  "n_test": 18467
}